TrainCase/case1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application      simpleFoam;
startFrom        latestTime;
startTime        0;
stopAt           endTime;
endTime          13500;
deltaT           0.3333333333333333;
writeControl     runTime;
writeInterval    10;
purgeWrite       2;
writeFormat      ascii;
writePrecision   6;
writeCompression off;
timeFormat       fixed;
timePrecision    0;
runTimeModifiable true;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
