TrainCase/case1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
31383
(
(4.94365 0.00669548 0)
(5.1905 1.06418e-05 0)
(14.7694 0.020076 0)
(5.00458 4.78355e-06 0)
(15.644 1.40467e-05 0)
(24.6527 0.0335552 0)
(4.86145 8.73467e-07 0)
(15.0833 1.51951e-05 0)
...
)
;

boundaryField
{
    base
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (570.7 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform (570.7 0 0);
    }
}


// ************************************************************************* //
