TrainCase/case1/0/Fs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Fs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
9.80435e-07
4.53144e-05
1.02187e-06
4.5282e-05
4.53593e-05
1.02889e-06
4.5379e-05
4.53038e-05
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
4.53978e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
4.53979e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
4.53382e-05
4.5087e-05
4.71574e-05
3.95384e-05
6.27892e-05
2.14402e-05
9.71289e-05
1.09568e-05
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
4.54858e-05
4.5486e-05
4.54862e-05
4.54864e-05
4.54866e-05
4.54869e-05
4.54871e-05
4.54873e-05
...
)
;
    }
}


// ************************************************************************* //
