TrainCase/case1/0/I1_4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I1_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
-0.191038
-9.99037
-0.0183598
-33.5308
-4.53576
-0.00660946
-1481.98
-8.22321
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
-1.93323e+67
-1.24659e+65
-5.37546e+64
-8.36749e+63
-3.55722e+63
-9.40084e+63
-9.68243e+63
-1.84036e+63
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-1.86621
-1.12208
-1.42968
-1.35348
-1.33546
-1.22677
-1.24236
-1.24293
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
-3.55321e-06
-1.30653e-06
-9.85815e-07
-9.4601e-07
-8.19365e-07
-4.8274e-07
-8.86697e-07
-6.60947e-07
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
-0.195659
-0.199519
-0.194214
-0.195959
-0.191563
-0.192268
-0.189745
-0.189876
...
)
;
    }
}


// ************************************************************************* //
