TrainCase/case1/0/I2_1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
2.65757e-13
9.53586e-11
4.64424e-10
8.21189e-11
1.02689e-07
3.23507e-08
7.3029e-11
8.86733e-08
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
7.87798e-11
9.51703e-11
8.19622e-11
7.28944e-11
6.66532e-11
6.18187e-11
5.78604e-11
5.46484e-11
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
8.15222e-32
5.06389e-31
2.61849e-30
6.33892e-30
5.70951e-28
2.12976e-28
3.22943e-27
1.02434e-26
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.58559e-08
4.27467e-05
0.000874735
0.00487461
0.015606
0.0233094
0.0425876
0.0321822
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
3.59766e-18
2.04582e-17
2.13509e-17
1.95903e-17
9.31216e-18
3.65912e-17
5.40349e-18
1.37561e-17
...
)
;
    }
}


// ************************************************************************* //
