TrainCase/case1/0/I2_3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
2.65751e-13
9.53586e-11
4.64414e-10
8.21189e-11
1.02689e-07
3.23501e-08
7.3029e-11
8.86733e-08
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
7.87797e-11
9.51703e-11
8.19622e-11
7.28944e-11
6.66532e-11
6.18187e-11
5.78604e-11
5.46484e-11
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
8.15222e-32
2.22203e-33
7.65043e-33
2.0688e-31
2.53244e-32
2.92021e-30
6.64095e-29
2.91475e-28
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.67471e-08
4.64909e-05
0.00104827
0.00645972
0.0207533
0.0356324
0.0521348
0.0510339
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
2.21561e-16
1.81974e-16
2.01006e-16
1.94045e-16
2.12689e-16
2.13274e-16
2.25481e-16
2.25305e-16
...
)
;
    }
}


// ************************************************************************* //
