TrainCase/case1/0/I2_4
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I2_4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.00912384
24.9519
8.42705e-05
281.078
5.14328
1.09212e-05
549065
16.9053
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
9.34346e+133
3.88495e+129
7.2239e+128
1.75037e+127
3.16346e+126
2.20939e+127
2.34374e+127
8.46727e+125
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.870686
0.314764
0.511
0.457979
0.445863
0.376241
0.385863
0.386216
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
3.15633e-12
4.26756e-13
2.42958e-13
2.23734e-13
1.6784e-13
5.82595e-14
1.96558e-13
1.09213e-13
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
0.00957064
0.00995195
0.00942976
0.00960003
0.00917414
0.00924174
0.00900079
0.00901323
...
)
;
    }
}


// ************************************************************************* //
