TrainCase/case1/0/Rekd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Rekd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.000155633
0.000163986
0.000189275
0.000157926
0.000281463
0.000252607
0.000153327
0.00026971
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
3.10837e-13
3.27641e-13
3.15544e-13
3.06364e-13
2.99534e-13
2.93907e-13
2.89053e-13
2.84927e-13
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2395.04
2164.08
1958.85
1776.86
1615.85
1473.77
1348.81
1239.3
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.963978
0.814215
1.71549
3.18304
4.76784
7.37039
8.4034
11.1743
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
2441.55
2441.62
2441.7
2441.78
2441.86
2441.95
2442.05
2442.15
...
)
;
    }
}


// ************************************************************************* //
