TrainCase/case1/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
332.907
332.942
332.629
332.946
332.708
332.307
332.948
332.72
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
333.036
333.036
333.036
333.036
333.036
333.037
333.036
333.036
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 200.264;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
333.175
338.872
341.071
340.9
347.638
338.705
348.315
335.068
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 200.264;
    }
}


// ************************************************************************* //
