TrainCase/case1/0/lambda1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
1.03109e-06
1.95303e-05
4.31029e-05
1.81239e-05
0.000640903
0.000359742
1.70914e-05
0.000595561
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
1.77517e-05
1.95111e-05
1.81066e-05
1.70756e-05
1.63283e-05
1.5725e-05
1.52132e-05
1.47849e-05
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.05763e-15
6.55418e-15
4.65021e-14
1.59426e-13
5.62418e-13
1.53851e-12
3.74989e-12
8.55569e-12
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.000660009
0.0182584
0.0826255
0.195052
0.323341
0.426733
0.478525
0.50107
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
1.19265e-05
1.19727e-05
1.20337e-05
1.20908e-05
1.21549e-05
1.22184e-05
1.22814e-05
1.23408e-05
...
)
;
    }
}


// ************************************************************************* //
