TrainCase/case1/0/nk
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nk;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.0610938
0.0616925
0.00118011
0.06168
0.00233313
0.000265711
0.0616693
0.00231005
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.000122798;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0645118
0.00673764
0.0117234
0.0190213
0.0292716
0.0376332
0.0435853
0.0455358
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.000122798;
    }
}


// ************************************************************************* //
