TrainCase/case1/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
4.33084e-11
4.81788e-11
4.2656e-11
4.47331e-11
9.0986e-11
7.87996e-11
4.21856e-11
8.36518e-11
...
)
;

boundaryField
{
    base
    {
        type            boundaryCorrectedNutLowReWallFunction;
        blending        stepwise;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 3.33333e-06;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            calculated;
        value           uniform 3.33333e-06;
    }
}


// ************************************************************************* //
