TrainCase/case1/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
1.83598e+10
1.83831e+10
3.02101e+09
1.84022e+10
3.14518e+09
1.02495e+09
1.84099e+10
3.14858e+09
...
)
;

boundaryField
{
    base
    {
        type            omegaWallFunction;
        blending        binomial2;
        n               2;
        beta1           0.075;
        value           nonuniform List<scalar> 
317
(
1.83598e+10
1.83831e+10
1.84022e+10
1.84099e+10
1.84122e+10
1.84159e+10
1.84217e+10
1.84252e+10
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 6e+06;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 6e+06;
    }
}


// ************************************************************************* //
