TrainCase/case1/0/p1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
4.85683e-11
5.1194e-11
1.18827e-10
4.93037e-11
1.70084e-10
2.77275e-10
4.78692e-11
1.62997e-10
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
4.85683e-11
5.1194e-11
4.93037e-11
4.78692e-11
4.68023e-11
4.59232e-11
4.51644e-11
4.45197e-11
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 7.45356e-07;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
3.25837e-10
1.80796e-09
1.00186e-08
3.74643e-08
1.04995e-07
2.32162e-07
4.12898e-07
6.16712e-07
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 7.45356e-07;
    }
}


// ************************************************************************* //
