TrainCase/case1/0/up
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      up;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.423777
0.212601
1.22587
0.208649
0.641224
2.05743
0.2056
0.629273
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
5.707e+12
1.60908e+06
822502
622794
411684
329582
268598
216942
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.517406
1.4666
2.88144
3.45032
5.08498
5.54415
6.98338
7.39386
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
6974.44
6968.75
6963.93
6958.9
6952.95
6949
6942.68
6937.79
...
)
;
    }
}


// ************************************************************************* //
