TrainCase/case1/0/wallDistance
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallDistance;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
5e-07
5e-07
1.50599e-06
5e-07
1.50598e-06
2.53001e-06
5e-07
1.50599e-06
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           uniform 1e-15;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.225621
0.203864
0.184531
0.167387
0.152219
0.138834
0.127062
0.116747
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.000499927
0.000500315
0.000500248
0.000500184
0.000500144
0.000500126
0.000500153
0.000500204
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
0.230003
0.23001
0.230017
0.230024
0.230032
0.230041
0.23005
0.230059
...
)
;
    }
}


// ************************************************************************* //
