TrainCase/case1/0/yp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
31383
(
0.101803
0.212707
0.317625
0.208749
0.641828
0.532528
0.205695
0.629839
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
4.15126e-10
4.25094e-10
4.17195e-10
4.111e-10
4.06507e-10
4.02683e-10
3.99354e-10
3.96502e-10
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0
7.264
12.8631
15.4096
21.1991
24.1516
27.1224
30.8542
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
458.293
435.416
352.813
425.438
340.375
401.276
313.73
343.893
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
317
(
1890.76
1892.37
1893.73
1895.17
1896.85
1898
1899.8
1901.22
...
)
;
    }
}


// ************************************************************************* //
